#include<reg51.h>
#define uchar unsigned char

uchar i;  //定义接受标志字符和接受暂存字符

//****************串口初始化函数*****************
void init_UART()
{
    SCON=0x50;  //设置串口工作方式1
    TMOD=0x20;  //设置计数器工作方式2
    PCON=0x80;  //波特率加倍
    TH1=0xF3;   
    TL1=0xF3;	//计数器初始值，波特率为4800,经过加倍后为9600
    EA=1;       //打开中断总开关
    ES=1;       //打开接收中断
    TR1=1;      //打开计数器
}
//*****************主函数**********************
void main()
{
    init_UART();
    while(1)
    {
        if(RI)
        {
            ES=0;      //关闭串口中断
       	    RI=0;              //接受标志位清零
            SBUF=i+1;    //接受到的数据写入SBUF
            while(!TI);//判断是否发送完
            TI=0;
            ES=1;      //打开串口中断
         }
     }
}   

//****************串行中断处理程序***************
void serial() interrupt 4
{
    i=SBUF;            //从SBUF读数据
}